################################################################
# # .쌍따옴표 와 홑따옴표 문자열 지정
# #   따옴표의 쌍이 맞지 않다면 오류
################################################################

#print("Hello")
#print('Hello')
#print("Hello')
#print('Hello")

################################################################
# # 코드 실행순서
# #  - 위쪽에서 아래쪽으로, 
# # 대입 연산자가 있을경우 오른쪽(리터널) 에서 왼쪽으로
################################################################

# print("Hello")
# print("Hello")
# print("Hello")

# age = acgea = 10

################################################################
# # Python 의 코드 단위
# # 블럭
# # 파이썬은 들여쓰기로 코드 블럭을 처리( C#, Java : {} )
################################################################

# # 파이썬의 블록 처리

# age = 11
# if age < 10 :
#     # age가 10 미만 일 경우만 실행되는 if문의 코드 블럭
#     print('10미만 입니다.')
# print('출력을 완료 하였습니다.')

################################################################

# # 주석
# # 개발자의 생각을 나타내는 코멘트
# # 컴퓨터는 이주석 구문을 무시하고 프로그램을 실행
# # 프로그램에 대한 분석 과 가독성을 높여 프로그램 개발성 향상에 도움을 주는 작업(기능)
# # 개발자가 가져야 할 중요한 습관
# # ctr + k + c : 다중 주석 처리, ctr + k + u : 다중 주석 해제

################################################################

